// Array = Collection of values (একাধিক মানের সমষ্টি)
// মূলত [] (স্কোয়ার ব্র্যাকেট) কেই Array বলা হয়।
// আপনি Array এর মধ্যে একাধিক বা একটি মাত্র ভ্যালু রাখতে পারেন।
// এই ভ্যালুগুলো হতে পারে: স্ট্রিং, নাম্বার, অবজেক্ট,
// এমনকি আপনি চাইলে Array এর মধ্যেও আরেকটি Array রাখতে পারেন (যাকে nested array বলা হয়)।

// const arr1 = [1, 2, 3]; // নাম্বার
// const arr2 = ["apple", "banana"]; // স্ট্রিং
// const arr3 = [{ name: "Hamim" }, { age: 22 }]; // অবজেক্ট
// const arr4 = [
//   [1, 2],
//   [3, 4],
// ]; // nested array
